# coding: utf-8
import math

print("        ")
print("###############################")
print("Электронный коллега 1.0v")
print("Автор: Дмитрий Павлухин")
print("###############################")


V = 0
work = 0
answer = 'Y'

while answer != 'Q':
    print("        ")
    print('Какую команду мне выполнить?')
    print('1 - Перевод из V в mV')
    print('2 - Перевод из mV в V')
    print('3 - Перевод из A в mA')
    print('4 - Перевод из mA в A')
    print('5 - Посчитать Мощность (A & V)')
    print('Q - Выйти из программы.')

    work = int(input(">>> "))

    if work == 1:
        print("        ")
        V = float(input("Введите V >>>  "))
        a = V * 1000
        print("###############################")
        print("Введено: ", V, "V")
        print("МиллиВольт: ", "%.1f" % a, "mV")
        print("###############################")

    if work == 2:
        print("        ")
        V = float(input("Введите mV >>>  "))
        a = V / 1000
        print("###############################")
        print("Введено: ", V, "mV")
        print("МиллиВольт: ", "%.2f" % a, "V")
        print("###############################")

    if work == 3:
       print("        ")
       A = float(input("Введите A >>>  "))
       a = A * 1000
       print("###############################")
       print("Введено: ", A, "A")
       print("Ампер: ", "%.2f" % a, "mA")
       print("###############################")

    if work == 4:
        print("        ")
        mA = float(input("Введите mA >>>  "))
        b = mA / 1000
        print("###############################")
        print("Введено: ", mA, "mA")
        print("Ампер: ", "%.3f" % b, "A")
        print("###############################")

    if work == 5:
        print("        ")
        A = float(input("Введите A >>>  "))
        V = float(input("Введите V >>>  "))
        W = A * V
        kW = W / 1000
        print("###############################")
        print("Введено: ", V, "V", " - ", A, "A")
        print("Ватт: ", "%.1f" % W, "W")
        print("КилоВатт: ", "%.2f" % kW, "kW")
        print("###############################")


